[
    {
        "id": 182,
        "attractions": [
            130,
            159,
            268,
            269,
            216
        ],
        "description": "遊程推薦 【路線】高捷橋頭糖廠站→余登發故居→捷運美麗島站→捷運市議會(舊址)站→高雄市勞工博物館→高雄市二二八和平公園→高雄市立歷史博物館  高雄是一個承載多方歷史、觀點與人權的城市，透過便利的捷運，以輕鬆的方式，一探那些發生在港都土地上的人文故事。 *以下歷史資訊引用自：高雄市政府人權專區>高雄人權地圖手冊  1.捷運橋頭糖廠站&橋頭火車站 旅程的起點，我們從捷運橋頭糖廠站開始了解台灣民主進程史上的「橋頭事件」。  1978 年8 月，當時的前高雄縣長余登發與其子余瑞言，被政府指稱為「匪諜」，罪名是「知匪不報」、「為匪宣傳」，判處有期徒刑八年;1979年1 月22 日，許信良、黃信介、陳菊、何春木、張俊宏、曾心儀等人於橋頭鄉進行示威遊行活動，為國民政府在台灣實施戒嚴四十多年以來第一次的政治示威活動，史稱「橋頭事件」。  不可錯過： 除了解橋頭事件的起源之外，別忘了在捷運站中看看超人氣的橘貓蜜柑站長，看他以超萌外觀，認真持續推動高雄寵物友善車站環境，為關懷流浪動物貢獻心力。  ■交通資訊：高雄捷運橋頭站R23、高雄捷運橋頭糖廠站R22A 出口 圖片來源：高雄捷運-蜜柑站長FB   2.余登發故居 第二站來到余登發故居，余登發先生是臺灣地方自治史上第一位黨外民選縣長，為了紀念這位敢向執政當權據理力爭的臺灣民主先行者，將故居整修開放，一樓以老先生的照片、物品展陳，二樓呈現的是臺灣民主史上佔有重要意義的「橋頭事件」。  在1978 年8 月，時任高雄縣長余登發與其子被控涉入「匪諜吳泰安事件」，被處以八年的有期徒刑。為此的聲援遊行是國民政府在台灣實施戒嚴四十多年以後第一次的政治示威遊行活動，在台灣的民主進程史上被稱為「橋頭事件」。  ■交通資訊：捷運橋頭糖廠站(R22) 步行前往   3.捷運美麗島站 第三站到訪的捷運美麗島站，車站為四座玻璃帷幕鋼骨站台建築，由日本建築師高松伸所設計，象徵「祈禱」之意，為了紀念當年在此地發生的美麗島事件。  1979 年12 月10 日發生的美麗島事件（或稱高雄事件、當時政府稱其為高雄暴力事件叛亂案），《美麗島》雜誌於世界人權日，在高雄舉行「人權大會」和平示威遊行，領導者施明德、林義雄、呂秀蓮、陳菊、許信良、黃信介等人對台灣人權的追求與付出，使台灣脫離威權統治，政府進而解除黨禁、解嚴，開放言論自由、媒體以及國會全面改選。  不可錯過： 捷運美麗島站以光之穹頂裝置藝術聞名，透過玻璃、彩繪及燈光組合的玻璃藝術創作，代表宇宙誕生、成長、榮耀與毀滅，被美國旅遊網站「BootsnAll」評選為全世界最美捷運站第二名。  ■交通資訊：高雄捷運O5/R10 美麗島站   4.高雄市勞工博物館 第四站的勞工博物館，是紀念與保存昔日高雄工業下的勞工文化，高雄工業發展已逾百年，台灣工運也從這塊土地萌芽，台灣的重工業心臟、拆船王國的核心，聞名於世的加工出口區都是以此為基礎，並曾創造臺灣經濟奇蹟。  近年高雄由工業轉型發展為以休閒觀光為主的海洋城市，這些社會脈絡為早期在地繁華的縮影，呈現獨特的勞工文化。為了保持及分享高雄珍貴的經濟成長脈絡及勞動文化價值，2009年特地成立了全國唯一的勞工博物館，讓來訪的人們了解臺灣勞工的生命故事與文化價值。  ■交通資訊：捷運市議會(舊址)站(O4) 2號出口步行5分鐘   5.高雄市二二八和平紀念公園 第四站的二二八和平紀念公園，是了解影響臺灣人權史的二二八事件始末的地點，以現代化地景式設建建立新紀念碑，168名可考的受難者姓名紀念牆以青翠矮樹襯托，引導人們進入紀念活動廣場，整體高雅莊嚴、深具人文及歷史意涵。  1992 年行政院成立「二二八事件研究小組」調查事件真相，而後由李登輝總統公開道歉，1995 年成立「二二八事件紀念基金會」，展開對受難者平反與賠償工作。1993 年高雄市政府在壽山建碑紀念二二八事件，惜碑文記述未詳，後因相關資料的出現，使事件梗概更趨詳實。2004 年以來，二二八受難家屬屢次建議政府另立新碑，以平撫受難者家屬的心靈，是以又於2006 年在仁愛公園重新建碑，為今高雄市二二八和平紀念公園。  ■交通資訊：捷運鹽埕埔站(O2) 2號出口步行約10 分鐘   6.高雄市立歷史博物館 最後一站來到高雄市立歷史博物館，這裡不僅是市定古蹟，也是228事件時的歷史現場，承載了高雄的光榮、傷痕與過去，以及城市發展的軌跡與市民生活的印記，是認識臺灣人權發展史不可錯過的景點。  高雄市立歷史博物館原為高雄市政府所在地，1992年市政府搬遷後，重新將古蹟再造，改裝成歷史博物館，成為臺灣第一座由地方政府經營的歷史博物館。  高雄市立歷史博物館建立於1939 年，最早為高雄市役所，1945 年經接收更名為高雄市政府，1947 年228 事件，此地被國民軍政府認定為反叛者聚會之所，因而展開軍事鎮壓，造成多位民眾和高雄市議員在這場攻擊行動中喪生。  不可錯過： 典雅的建築外觀，以淺綠的國防色系為基調，整體採中央主塔搭配兩側對稱的塔樓式造型，中軸線的設計表達莊嚴、隆重的氣氛，頂部疊加上日本傳統的四角攢尖與琉璃瓦大屋頂，是來此必看的一大重點。  ■交通資訊：捷運鹽埕埔站(O2)2 號出口或市議會站(O4)2 號出口步行10 分鐘 路線：高捷橋頭糖廠站→余登發故居→捷運美麗島站→捷運市議會(舊址)站→高雄市勞工博物館→高雄市二二八和平公園→高雄市立歷史博物館"
    },
    {
        "id": 181,
        "attractions": [
            156,
            186,
            232,
            239,
            11
        ],
        "description": "高雄有著許多打卡拍攝聖地，如蓮池潭龍虎塔、壽山情人觀景台捷運美麗島站光之穹頂等知名景點，就讓我們穿越這些風景名勝，分享在高雄的美好時光吧！ 必買伴手禮 棋餅(中外餅鋪)、農特產品(高雄物產館)交通建議 輕軌、自行車、計程車  舊城推薦美食 酸菜白肉火鍋、汾陽餛飩、桂花燒雞、手工麵食   "
    },
    {
        "id": 180,
        "attractions": [
            284,
            232,
            1175,
            1139
        ],
        "description": "在高雄的熱鬧商圈中，盡情購物及品味當地的美食，無論是時尚服飾還是特色伴手禮，應有盡有，如果逛累了，不妨搭乘愛之船或貢多拉，享受愛河水岸休閒風情，讓身心靈徹底的放鬆。  必買伴手禮 文創商品、火星糖、木棉酥交通建議 輕軌、捷運、計程車  商圈推薦美食 後山林記炸彈蔥油餅 高雄市前鎮區復興三路129號 +886-929237788  福莉牛雜湯 高雄市前鎮區凱旋四路316號 +886-7-8118050  興中商圈美食 高雄市苓雅區文橫二路  南華商圈美食 高雄市新興區南華一路大同一路口  新堀江商圈美食 高雄市新興區玉竹二街  福記臭豆腐 高雄市苓雅區海邊路53巷52號 +886-7-2419477  綠豆王甜湯商店 高雄市苓雅區五福三路105號 +886-7-2215520  鹽埕商圈美食 高雄市鹽埕區大勇路週邊"
    },
    {
        "id": 179,
        "attractions": [
            121,
            1220,
            230,
            117,
            119
        ],
        "description": "搭乘渡輪前往旗津，在海產街吃著海味、在海水浴場腳踩著細沙欣賞蔚藍海洋景色、在旗津沙灘吧享受超CHILL氛圍，入夜後前往首座開放夜間參觀的高雄燈塔，感受這座越夜越美麗的城市！ 必買伴手禮 海味商品、文創禮品交通建議 輕軌、渡輪、自行車  旗津推薦美食 正家興波士頓派 高雄市旗津區旗津二路115號 +886-5716541  蕃茄切盤 高雄市旗津區廟前路  鴨角活海產店 高雄市旗津區廟前路22號 +886-7-5716325  旗后活海產店 高雄市旗津區廟前路31號 +886-7-5715808  Cijin Sunset Bar 旗津沙灘吧 高雄市旗津區旗津三路1050號 +886-7-5716120  炭烤小卷 高雄市旗津區廟前路+旗津三路  金聖春海產 高雄市旗津區中洲巷68之22號 +886-7-5713603  斗六冰城-旗津二店 高雄市旗津區旗津三路916巷2號 +886-7-5714932"
    },
    {
        "id": 178,
        "attractions": [
            1243,
            1217,
            320,
            216,
            1147,
            1232
        ],
        "description": "嚐美食來鼓山、鹽埕區就對了！在這裡你可以找到全台最美的鼓山魚市場、享譽全台的鹽埕奶茶街，當然也不能錯過當地的特色小吃，讓味蕾來場全新的美食之旅。 必買伴手禮 麻糬、旗鼓餅、木棉酥、烏魚子、文創商品交通建議 捷運、自行車  哈瑪星、鹽埕推薦美食 哈瑪星汕頭麵(呂) 高雄市鼓山區鼓波街27-16號 +886-7-5323228  渡船頭海之冰 高雄市鼓山區濱海一路76號 +886-7-5513773  哈瑪星黑旗魚丸大王 高雄市鼓山區鼓波街27-7號 +886-7-5210948  蘇阿嬤雞蛋酥 高雄市鼓山區濱海一路96號 +886-955-972771  樺達奶茶 高雄市鹽埕區新樂街101號 +886-7-5512151  冬粉王 高雄市鹽埕區七賢三路168號 +886-7-5514349  阿綿麻糬 高雄市鹽埕區新樂街198-27號 +886-7-5319177  阿囉哈滷味 高雄市鹽埕區大仁路158號旁 +886-930-103443"
    },
    {
        "id": 177,
        "attractions": [
            8,
            206,
            6,
            1175,
            276,
            192
        ],
        "description": "讓高雄輕軌帶您穿梭於城市之間，體驗亞洲新灣區帶來的魅力，城市與港都的完美結合，在徐徐海風吹撫下走逛高雄文創新亮點。  交通建議 輕軌、自行車  必買伴手禮 文創商品、麻糬、旗鼓餅、木棉酥  鹽埕推薦美食 鴨肉珍 高雄市鹽埕區五福四路258號 +886-7-5215018  下一鍋水煎包 高雄市鹽埕區大禮街24號 +886-915-010853  鹽埕王家手工豆花 高雄市鹽埕區新樂街213-6號 +886-7-5619412  藕家蓮藕粉珍珠奶茶 高雄市鹽埕區大勇路87號 +886-7-5211388  佬姥碳烤三明治 高雄市鹽埕區新樂街200號 +886-7-5312010  米糕城 高雄市鹽埕區大仁路107號 +886-7-5333168     "
    }
]