[
    {
        "id": 11,
        "name": "蓮池潭風景區（龍虎塔整修中）",
        "latlng": "22.67873,120.29690",
        "opentimeGoogle": [
            "星期日：24 小時營業",
            "星期一：24 小時營業",
            "星期二：24 小時營業",
            "星期三：24 小時營業",
            "星期四：24 小時營業",
            "星期五：24 小時營業",
            "星期六：24 小時營業"
        ],
        "googleScore": "4.3",
        "url": "https://khh.travel/zh-tw/Attractions/Detail/11",
        "cover": "https://khh.travel/content/images/Attractions/19849/480x360_attractions-image-g0qs4l9vqu20shcpxhp0cw.jpg",
        "type": "Attractions",
        "description": "擁有深邃東方寓意的勝境 位於左營區的蓮池潭，南鄰龜山、北倚半屏山，清朝時期因潭中遍植荷花，每逢夏季清香四溢，素有「泮水荷香」美譽，成為清代的鳳山八景之一；蓮池潭畔的指標性建築「龍虎塔」，讓人感受到東方宗教文化的震撼，曾被美國有線電視CNN特別推薦，是高雄市最具傳統宗教色彩的風景區之一。  蓮池潭畔廟宇眾多達20多座，以龍虎塔、春秋閣、北極玄天上帝、孔廟等最知名，其中，龍虎塔最受國際旅客喜愛，是來高雄必訪的熱門景點，CNN曾於2014年刊登「愛上高雄十大理由(10 reasons to love Kaohsiung)」中，特別推薦消災解厄的「蓮池潭龍虎塔」。   龍虎塔（預計 2024 年底完工，2025 年第一季重新開放） 龍虎塔建於1976年，高7層的塔可由龍口進、虎口出，龍塔內壁畫有勸世故事的交趾陶作品，出自名家之手，塔身與九曲橋相銜、相映湖面成美景。據說參觀龍虎塔有規矩，要從龍口進入、虎口出來，意即「入龍喉出虎口」，就能趨吉避凶，登上塔頂即能一覽蓮池潭美景全貌。  春秋閣 與龍虎塔為鄰的春秋閣建於民國42年（西元1953年），矗立在此已經超過一甲子，為兩座中國宮殿式樓閣，一稱「春閣」，另一稱為「秋閣」，為紀念孔子作「春秋」而命名。各為四層八角、綠瓦黃牆，宛如寶塔，古色古香的塔影倒映水中，並與九曲橋相互連結，為紀念武聖關公而建，造型為當時全臺灣塔中之翹楚，又稱「春秋御閣」。春秋御閣設有一座龍形隧道，與龍虎塔相似，旅客同樣可以依循著指引走進龍口，進入後的隧道繪有五彩繽紛的彩繪，訴說著許多宗教故事，繪製的細節非常豐富，許多人帶著虔誠的心來走訪並欣賞牆上的精緻畫風。位在春秋閣的前端有一尊騎龍觀音，關於此一騎龍觀音的由來有一傳說：觀音菩薩曾騎龍在雲端現身，指示信徒要依其現身之形態建造聖像在春閣與秋閣之間，於是有現今的騎龍觀音聖像。   五里亭 五里亭源於「五里霧」，李商隱詩：「五里無因霧」，按照世間說法，處於迷離之境者曰五里霧。「五里亭」亭子高度約兩層樓，飛簷黃瓦，明豔奪目。當早晨晨曦初露，蓮池潭瀰漫著煙波時，五里亭就會宛如罩上一層薄霧，看起來就像浮在潭面的仙殿。而當夜幕降臨時，堤岸突出的漫長宮燈，會散發出柔和燈光，也猶如世外仙境。若是循著「五里亭」的樓梯登上二樓，就可以眺望整個蓮池潭，景色充滿東方情調，也展露江南林園樓台之美。   孔廟 左營蓮池潭旁的孔廟規模為全臺最大，仿中國北方宮殿式建築，並參考山東曲阜孔廟形態，建築外觀建築宏偉堂皇，包括大成殿、大成門、東西廡、崇聖祠、櫺星門、禮門與義路坊、明倫堂與泮宮坊、萬仞宮牆、泮池與拱橋等，建置完備。  早在西元1684年，即由知縣楊芳聲建有聖廟，後來因風雨損壞，於乾隆及光緒年間皆有修建，才形成現今完整規模。每年9月28日教師節有祭孔大典。 蓮池潭兒童公園 蓮池潭兒童公園是高雄知名的親子景點，一改過往千篇一律的組合式遊具，蓮池潭兒童公園設立了多樣化且具地方特色的遊具，為高雄第一座共榮式公園。繽紛的彩虹山丘，集結了傳聲筒、管隧道、攀岩等元素，讓小孩盡情探索；化身蜘蛛人，在沙坑區的繩索攀爬架訓練協調力；近期更新增了長達30公尺的滑索道，並設有鳥巢鞦韆、平衡木等設施，是親子同樂共學的好去處。   在蓮池潭畔享受慢活生活的美感 蓮池潭畔因亭台樓閣、巨大神像和城牆的環繞，滿溢「舊城」氛圍，古蹟名勝、古厝、眷村等聚落帶出濃厚的生活氣息，走進老街與傳統市集更能以舌尖探索左營豐富精采的好滋味！蓮池潭風景絕美，更有多項水上活動供熱愛刺激感的遊客過過癮。環潭步道不僅能夠滿足散步者靜賞潭面風光的體驗，更是能滿足自行車車友踩著踏板，以不同節奏穿梭其中的快意。  蓮潭滑水主題樂園 全台首座國際標準的纜繩滑水場–「蓮潭滑水主題樂園」，自民國103年開幕以來，吸引超過破百萬人次的觀光人潮，搭配不定期舉辦國際邀請賽，吸引來自不同國家的遊客前來，比賽期間透過媒體轉播，用運動觀光的角度再創觀光高峰，讓更多人認識不一樣的高雄。  泮咖啡 「泮咖啡」(PAMMA Coffee)位於蓮池潭元帝廟旁，融合環境生態，明亮純白建築，欣賞著典雅水畔景色，內有提供輕食飲品，品嚐咖啡美食之餘可飽覽蓮池潭美景，為本市著名蓮池潭風景區吸引國內外遊客旅遊打卡新景點。   芒果咖秋 誰說下午茶只能在咖啡廳甜點店吃？來高雄左營孔廟喝杯咖啡吃吃下午茶吧！坐落在孔廟裡的芒果咖秋，有百元初的好喝咖啡飲品，有傳統糕點下午茶，在古色古香的氣氛中，讓你徹底體驗一個不一樣的中國風咖啡下午茶！  城邑左營慈濟宮 城邑左營慈濟宮，簡稱城邑慈濟宮、左營慈濟宮，當地人俗稱老祖廟，主祀保生大帝。建於清康熙58年(西元1719年)，至今已有將近300年的歷史，雖然經歷多次重修，已與舊貌不同，但保留下來的匾額、對聯、石牌仍可感受當時樸式卻安慰人們的力量。 中外餅舖 傳承百年的中外餅舖，從傳統糕餅製造批發起家，歷經世代傳承與創新開發，早已是高雄著名的特產伴手禮店家。如今結合7-11拓展通路，共同打造蓮潭特色糕點。中外餅舖詳細介紹➜“棋餅”老店用愛傳承｜中外餅舖 ｜【台灣真善美】",
        "images": [
            "https://khh.travel/image/19881/?r=1666332945724",
            "https://khh.travel/image/19849/?r=1590385651030",
            "https://khh.travel/image/19894/?r=1666332930810",
            "https://khh.travel/image/42687/?r=1673064172033",
            "https://khh.travel/image/41281/?r=1666752636692",
            "https://khh.travel/image/20614/?r=1591091503252",
            "https://khh.travel/image/43395/?r=1675147717620",
            "https://khh.travel/image/1567/?r=1664525933484",
            "https://khh.travel/image/19897/?r=1590400847504",
            "https://khh.travel/image/42749/?r=1673064195838",
            "https://khh.travel/image/20615/?r=1591091831137",
            "https://khh.travel/image/20616/?r=1591092176285",
            "https://khh.travel/image/20611/?r=1591090482949",
            "https://khh.travel/image/45992/?r=1689566341272"
        ]
    },
    {
        "id": 1143,
        "name": "旗津",
        "latlng": "22.61418,120.26594",
        "opentimeGoogle": [],
        "googleScore": null,
        "url": "https://khh.travel/zh-tw/Attractions/Detail/1143",
        "cover": "https://khh.travel/content/images/Attractions/20167/480x360_attractions-image-nwdr19kb0kaijqlw8601ra.jpg",
        "type": "Attractions",
        "description": "搭配高雄好玩卡 輕鬆玩旗津 旗津踩風一日遊、二日遊，一卡在手，親身感受旗津地區的美！ 好玩卡購買資訊  2022台灣燈會副燈在旗津-龍騰獻瑞 位於旗津廣濟宮（高雄市旗津區旗津二路255 號）。 龍是人類世界對未來美好的憧憬與想像，追求理想的動能。 龍身從磅礴的海面一躍而起，拍打的浪花是台灣前進的動力，映照出高雄港都獨有的七彩繽紛。讓美好的理念帶領著我們，永保追尋的動能，串起台灣已知的符碼，以及對未來的想像。（資訊來源：2022台灣燈會官網）   入夏怎能錯過旗津海水浴場？ 旗津海水浴場與西子灣齊名，每年四月至十月開放期間，總能吸引大量遊客爭相報到。夏日艷陽高照，踩踏著旗津細軟的沙，泡進清澈海水裡一解炎熱酷暑。海水浴場內設施多元，其中包含了救生與沖洗設備。除了玩水，更有觀海景觀步道、自然生態區及越野區等不同的休憩場域。黃昏時刻，夕陽斜照，晚霞燦爛，漫步在海岸線，海風輕拂，這就是夏天該有的浪漫模樣！  朝聖全台第一座媽祖廟—旗津天后宮 旗津天后宮祀奉海神媽祖已有三百多年歷史，是全台第一座媽祖廟，更是高雄最古老的廟宇，現今的天后宮是以1926年重建的廟體為基礎，屬華南式廟宇建築，遍處可見木雕、石刻、彩塑等藝術形式。先民渡海的信念和歷史軌跡在旗津穩妥地被留存下來。作為高雄地方的信仰集會中心，裊裊香煙除了象徵著各地信眾虔敬的信仰，更象徵了媽祖對蒼生的守護與民間傳統藝術的維護傳承。  旗津沙灘吧 作為旗津觀光亮點，「旗津海灘吧」除了提供美味的輕食及冷飲外，更可以舉辦多元沙灘體育活動，包括了沙灘足球、沙灘排球等。為旗津的夜增添了更多樂趣及魅力，旗津的夜，狂野而熱情。 海之星沙灘俱樂部 海之星沙灘俱樂部位在海岸公園旁，白色貨櫃屋及充滿異國風味的椰子樹，風格以藤編原木桌椅及植栽造景為主軸，讓人彷彿置身在海島國家，俱樂部旁有著鮮艷顏色的彩虹步道，成為許多遊客打卡景點，悠哉的吹著涼涼的海風，度過浪漫午後風情，享受著夕陽下山的美麗時分。   以車輪丈量旗津—旗津環島自行車道 旗津擁有獨特的沙洲半島地形，狹長的地形十分適合利用自行車的便捷輕巧，以最舒適的速度漫遊旗津的人文與自然之美，環島自行車道共有五大迴路，其中以第一迴圈「馬雅各紀念自行車道」最為精彩，屬人文歷史景觀自行車道。以人文歷史古蹟與海岸線自然景觀兩大部分組成旗津豐富繽紛的樣貌，除了可滿足遊客對昔日的緬懷與感念，更能夠登高眺望港都壯麗的山海景緻。旗津，自然風光與人文底蘊的完美結合。  盡覽「大海的贈禮」—旗津貝殼館 旗津貝殼館位於高雄市旗津區旗津三路887號2樓，為國內規模最大的公立貝殼展示館，展示約有2000多種貝類的標本，館藏由黃葛亮先生及沈淑惠小姐提供。鎮館之寶是巨大的「二枚貝」，其他珍奇貝類如鸚鵡螺、黑星寶螺、龍宮貝等，也是美不勝收的珍藏。  旗津星空隧道 開鑿於日治時期，穿透旗後山的旗津隧道原為軍事戰備隧道，於2005年整建，開闢成星光隧道供遊客及自行車族遊憩。隧道內鋪設木棧道，內壁飾以十二星座的夜光彩繪及漂流木、蓄光石等素材，洞口吹來的清涼海風，頗有置身點點星空下的浪漫之感。星空隧道串連旗後燈塔、旗後砲台、珊瑚礁地形等獨有美景，是全國唯一的海景自行車道，無論步行或騎車，皆能給予遊客身心視野的驚豔感受。  全台唯一白色八角磚造燈塔—高雄燈塔(旗后燈塔) 民國前29年（西元1883年）設置的高雄燈塔，俗稱「旗后燈塔」，位於高雄市旗津區旗后山頂，其塔身則為台灣地區唯一的白色八角形磚造燈塔，頂部呈現圓筒形，可由燈塔陽台眺望高雄市全景。高雄港是台灣南部的主要門戶，因此興建高雄燈塔自有助於確保商船往返貿易的安全。已有一百多年歷史的高雄燈塔，不僅見證了高雄港篳路藍縷的開發過程，於二次大戰時雖曾遭受機槍掃射，惟並無損害，始終發光不輟。  饒富童趣的療癒景點—旗津風車公園 旗津風車公園它銜接旗津漁港的觀光步道，扮演過港隧道進入旗津門面的第一個海岸印象景點，旗津擁有豐沛的風力資源，七座造型獨特的三葉式風車面對遼闊的海面不停轉動，園區內有觀海看台及表演廣場，造型獨特又可愛的海洋生物拼貼創作，既生動又有趣，堪稱旗津最療癒的景點。若騎單車到此，約為旗津地區的中段處，剛好可稍作休息。從風車下方就能看到海面上襲來一波波巨浪，打在岸邊激起滔天浪花，十分壯觀。  旗津海產美食 來到旗津遊玩，別忘了到廟前路享用海產大餐，可補充體力，消除遊玩後的疲累，讓你大飽口福。  黃金海韻-海珍珠 高10公尺、寬16公尺、深達9公尺，是由藝術家林舜龍與法國聲音藝術家葉澎生攜手耗時6年打造而成。其以金色為主色，半圓形海貝殼為造型，藉由不同角度的陽光照射，展現深淺不一的黃金色澤。不僅是旗津公園的地標之一，更是亞洲最大的貝殼裝置藝術。  雨過天晴，在旗津等一道彩虹 旗津彩虹教堂，以幾何建築形態為主要設計元素，隨著晨昏各異的光影變幻產生奇幻的空間感，又一處天然地景與人文交會的勝境。以大海的藍彩作背景，色彩繽紛的俐落線條如同相機的觀景窗，按下快門，捕捉下浪濤與天際絕佳互動。浪漫的異國風情不必遠渡重洋，在旗津盡享幸福。  「風收．豐收」 隨風舞動的雙臂，像是海洋女神幫人們把狂風收納起來，也像漁獲豐收時漁民的歡呼。在大海與風的能量中，把電子地圖的紅色地標定位在旗津，揭示著旗津是夢想的目的地，未來幸福豐收的起點。（作者：梁任宏）  津鯨有約 此作品轉化鯨魚的型態，以結構線條勾勒噴泉形態，讓人聯想到海洋，呼應鯨魚在大海中自由、勇往直前的模樣。噴泉由兩組搖椅構成，前後角度分別傾斜30度時會交錯成心型。透過藝術裝置賦予環境無限的想像以及嶄新的氛圍。  海濱旗緣 藝術家賦予了作品一個奇幻的故事，大航海時代傳說的海洋之心是人們的結識之物，卻被海洋大盜魷魚哥偷走。海馬騎兵便帶著弓箭，一路追趕到了旗津。此作品結合座椅設計，讓民眾坐在作品旁拍照，希望大家一同協助海馬騎兵，守護海洋之心。（作者：林建志）  相約小鹿 梅花鹿，台灣特有物種，以前被視為神物的鹿，象徵吉祥幸福與長壽。盼生活在都市叢林中的大家，能夠停下腳步、重拾童心，思考人與自然間密不可分的關係，喚起大家對生態保育及環境永續之重視。（作者：任大賢）  心的觸角 來自港口部落的阿美族藝術家，近年的創作手法以碎形的木條重複連接、堆疊的形式勾勒出流動姿態，呈現濱海生活與海浪強烈的關聯。心的觸角外型像是章魚的木造裝置，開口框出一個海景和空景，讓人可以放鬆看海，靜下心來與自己對話，也表達藝術家對於環境議題的深刻體認。（作者：伊祐・噶照）  海岸的守護者 旗津海岸旁一個義勇救人紀念碑，述說1993年五位學生手拉手捨己救人的義行。除了象徵救人的勇氣，也在提醒注意海域危險；並向每位救生員致敬，讓我們能在此舒服的散步，與親朋好友一起相約在此遊憩，度過寧靜的時光。（作者：阿部乳坊）  津奇號 心內話就像潛艇一般在內心波濤，透過津奇號幫恁講出來，找找彼方的聲音在哪裏。藝術家以「聲音」為元素，打造潛水艇造型「津奇號」，作品上的水管都是傳聲筒。遊客可以傾聽水管傳來的聲音，兩人互動許下約定，用心感受周遭環境。（作者：蔡坤霖）  旗津藍眼淚 旗津海水浴場裡的沙灘棧道，傍晚一到就會點上藍色燈光，以LED燈條及環境光照明點綴，現在不用到馬祖，在高雄旗津也能感受沙灘藍眼淚的浪漫。",
        "images": [
            "https://khh.travel/image/38627/?r=1646894378446",
            "https://khh.travel/image/20393/?r=1590394480518",
            "https://khh.travel/image/20442/?r=1590402128202",
            "https://khh.travel/image/20403/?r=1590394505413",
            "https://khh.travel/image/41287/?r=1666771722043",
            "https://khh.travel/image/20172/?r=1590398579104",
            "https://khh.travel/image/20421/?r=1590398415720",
            "https://khh.travel/image/45722/?r=1687923722333",
            "https://khh.travel/image/45723/?r=1687924235573",
            "https://khh.travel/image/20396/?r=1590394564806",
            "https://khh.travel/image/20607/?r=1591089243797",
            "https://khh.travel/image/20518/?r=1605499444774",
            "https://khh.travel/image/20394/?r=1618216916053",
            "https://khh.travel/image/22376/?r=1605497582198",
            "https://khh.travel/image/22371/?r=1605497649916",
            "https://khh.travel/image/22372/?r=1605497677582",
            "https://khh.travel/image/22377/?r=1605497884933",
            "https://khh.travel/image/22373/?r=1605497925293",
            "https://khh.travel/image/22375/?r=1605497968932",
            "https://khh.travel/image/22374/?r=1605497995205",
            "https://khh.travel/image/39555/?r=1652938792332"
        ]
    },
    {
        "id": 1228,
        "name": "蓮池潭－春秋閣",
        "latlng": "22.68240,120.29212",
        "opentimeGoogle": [
            "星期日：06:00 – 21:00",
            "星期一：06:00 – 21:00",
            "星期二：06:00 – 21:00",
            "星期三：06:00 – 21:00",
            "星期四：06:00 – 21:00",
            "星期五：06:00 – 21:00",
            "星期六：06:00 – 21:00"
        ],
        "googleScore": "4.2",
        "url": "https://khh.travel/zh-tw/Attractions/Detail/1228",
        "cover": "https://khh.travel/content/images/Attractions/42721/480x360_attractions-image-ruajefubckgrpixnkw1gna.jpg",
        "type": "Attractions",
        "description": "清晨漫步在高雄左營舊城蓮池潭畔春秋閣上，此時旭日東昇的晨光，暈染了火焰木花朵染紅了稍有寒意的春天，春秋閣位在高雄市左营區蓮池潭景區內西南方，是世界知名景點，由兩座大小相同的中國宫殿式樓閣组成，於1951年用當地隨手可得的在地木材及木麻黄作為建築基底，各為四層八角，雕畫棟，臨風玉立，左邊供奉孔子【作 春秋】亂臣賊子懼，右邊供奉文武關聖帝君【春】，將此雙塔命名為【春秋御閣】，是寶塔中翹楚，與龜山腳下有300多年歷史的古舊城牆相互輝映。  古典樸質的造型是台灣八大奇景之，於2004年榮獲台灣十大特色建築獎，走進巨龍內部细數階梯共有108階，龍身為彎曲狀，龍腹浮雕十八羅漢及觀音三十二幅繪像，龍身全長二十五丈七尺，龍身到觀音頭頂三丈六尺，踩著緩慢悠閒的腳步，欣賞著裡面的畫作，全手工畫作呈現都是勸人向上及意寓故事，情不自禁將塵世煩都拋諸腦後，步出龍肚後看到春秋閣與五里亭玉欄橋相通，兩旁開滿朵朵蓮花明艷奪目，盡頭處為一座三層式亭塔，此地為送往迎來諸聖仙佛聖駕蒞堂的儀站，每到傍晚時分與蓮潭八景之一的蓮潭夕照互相揮映，美不勝收讓人流連忘返。   左營廟宇文化旺盛是台灣廟宇密度最密集之處所，春秋閣由啟明堂建置及管理，於1899年由先賢謝知先生與旺先生設於左營後菜園陳重三私宅，當時供奉【五公菩薩】為主神，1903年供迎前峰尾（現左營舊城內）關聖帝君來堂奉祀，同年呂恩主（孚佑帝君） 降巒攜帶玉旨宣示，赦賜改名為啟明堂，又調任武里關聖帝君為主神，從此莫下【文武】二聖同祀之基石，於今已邁入123年歷史，是一個假日攜家帶眷悠閒慢活的好所在。  ※本文由中外餅舖提供",
        "images": [
            "https://khh.travel/image/42723/?r=1673063616850",
            "https://khh.travel/image/42692/?r=1672997912212",
            "https://khh.travel/image/42721/?r=1673063596766",
            "https://khh.travel/image/42689/?r=1672997924223"
        ]
    },
    {
        "id": 162,
        "name": "田寮月世界",
        "latlng": "22.88600,120.38898",
        "opentimeGoogle": [],
        "googleScore": null,
        "url": "https://khh.travel/zh-tw/Attractions/Detail/162",
        "cover": "https://khh.travel/content/images/Attractions/20398/480x360_attractions-image-scvbhgtswka0el7kfq8kca.jpg",
        "type": "Attractions",
        "description": "訊息公告：月世界天梯步道整修，111年9月29日起封閉，預計封閉至112年6月30日。  田寮「月世界」特殊景觀在地理學上稱為「惡地」，是由於地殼的「回春作用」，經年累月的經由雨水與河水強烈侵蝕，將泥沙堆積在泥岩上，地層變動後，泥沙更與泥岩混合再經由風化、沉積作用，形成今日地貌，僅適於耐旱、耐鹽的淺根植物（如：箭竹）、濱海植物生長。  從田寮到旗山台28線沿路除了月世界景觀，還有大小不等的二十多個泥火山，常呈現間歇性的噴發現象，噴發的規模則視地底天然氣與泥漿的累積壓力而定，噴發後的泥流堆積地區，經降雨沖蝕，產生一些特殊的小地形，其中大滾水與小滾水是觀察泥火山最方便的地點。  泥火山是地下的天然氣、泥漿受高壓作用，沿著淺層岩體裂縫噴出地表的「假火山」，它也是惡地形的一種。田寮是全臺惡地形與泥火山最發達的地區，古亭坑層泥岩構成的惡地景觀，充滿淒涼荒漠之美，宛如未經人工鑿斧的地質生態教室，更發展出特有物產和美食。  高雄市觀光局110年10月於愛河及田寮月世界辦理熱氣球活動，受到各界熱烈迴響，吸引許多各地的遊客，讓民眾一解渴望升空的偽出國癮、享受高雄之美，月世界特殊泥岩地形媲美土耳其卡帕多奇亞，當地首次舉辦熱氣球繫留體驗，令人屏息的美照引爆網路高度詢問。    位於風景區入口處的「泥岩地質生態解說中心」，館內展示泥岩的樣本及圖片說明，可說是深度認識田寮月世界的鎖鑰。",
        "images": [
            "https://khh.travel/image/18410/?r=1590460564149",
            "https://khh.travel/image/18411/?r=1590460585918",
            "https://khh.travel/image/18412/?r=1591090962626",
            "https://khh.travel/image/39319/?r=1651720306349",
            "https://khh.travel/image/39316/?r=1651719177426",
            "https://khh.travel/image/39317/?r=1651720326001",
            "https://khh.travel/image/18408/?r=1590460609014"
        ]
    },
    {
        "id": 6,
        "name": "駁二藝術特區",
        "latlng": "22.62001,120.28160",
        "opentimeGoogle": [
            "星期日：10:00 – 20:00",
            "星期一：10:00 – 18:00",
            "星期二：10:00 – 18:00",
            "星期三：10:00 – 18:00",
            "星期四：10:00 – 18:00",
            "星期五：10:00 – 20:00",
            "星期六：10:00 – 20:00"
        ],
        "googleScore": "4.4",
        "url": "https://khh.travel/zh-tw/Attractions/Detail/6",
        "cover": "https://khh.travel/content/images/Attractions/37670/480x360_attractions-image-kklpdqdwkkm9gq6f7d688w.jpg",
        "type": "Attractions",
        "description": "駁二藝術特區的前身為高雄港倉庫，建於1973年，過去儲放魚粉與砂糖，隨著產業轉型，一度遭遺忘閒置；直到2000年高雄市政府因尋找國慶煙火施放地點的機緣下，才讓這些舊倉庫起死回生、開創新生命，見證高雄港的繁華、沒落、再起與轉型。  因倉庫位於高雄港第二號接駁碼頭，藉其意涵而命名為「駁二」有傳承之意。一路走來，有公部門與民間齊心努力，才得以成為現在的「駁二」，成為臺灣最成功的文創園區之一，開啟高雄一股南方藝術的新潮流，帶動高雄城市轉型契機  從過去到現在，駁二藝術特區都是高雄人不可缺少的倉庫群。過去儲放貨物供應港口，現在改頭換面成為藝術家的創作天堂，匯集滿滿的設計與創意能量；過去有港邊載送貨物的西臨港線鐵道，現在則是高雄最熱門的水岸輕軌。  駁二藝術特區向民眾、在這個城市開展創意發想，透過各種公共藝術作品，向民眾互相親近對話，民眾可漫步、搭乘水岸輕軌穿梭其間，感受創意街區裡的悠閒與美學，是連高雄人也愛的創意基地。  經營發展過程 駁二藝術特區經過許多人、許多年的努力，規模從發展初期的2棟倉庫，到現在擁有大勇倉庫群、大義倉庫群和蓬萊倉庫群等共25棟倉庫空間，是高雄重要的城市記憶。  一切源起於2000年，雙十煙火第一次不侷限在台北施放，決定南下高雄綻放，為尋覓適當的放煙火地點，人們發現了港口旁駁二倉庫的存在，一群熱心熱血的藝文界人士於2001年成立駁二藝術發展協會，將駁二規劃成一個獨特的藝術開放空間，催生推動駁二藝術特區作為南部人文藝術發展的基地。  駁二藝術特區透過文化部（當時的文建會）「閒置空間再利用」計畫改頭換面，為高雄開啟藝文、文創的新視窗，成為南部地區的文創重鎮。營運初期以公辦民營的模式，歷經駁二藝術發展協會、樹德科技大學，最後2006年由高雄市文化局接手。  2006年高雄市政府文化局接手至今，將駁二藝術園區定位為，當代藝術與常民美學雙軌併行，將倉庫空間轉變為文創設計、生活藝術、當代藝術、獨立音樂、公共藝術等展演場域。  陸續舉辦了高雄設計節、好漢玩字節、鋼雕藝術節、貨櫃藝術節、高雄人來了大公仔、The Wall駁二音樂演唱會等，匯集來自世界各地的藝術創意，透過一次又一次的展演，激盪出嶄新火花，上演海港城市的魅力文化與生活美學。  現今的駁二藝術特區 駁二藝術特區以大勇區為中心，透過水岸輕軌串連蓬萊區與大義區，構築出獨特的海洋特性的文創氛圍。駁二塔則是登高望大港橋的最佳觀景台，每人每次10元投幣入場。  大勇倉庫群－駁二的故事從這裡開始 共有12棟倉庫，其中C5、P2為駁二最草創時期的兩個展覽場域，這兩棟倉庫目前都仍以靜態展覽為主要用途。陸續加入營運陣容的C1、C2、C4及自行車倉庫，目前主要籌辦實驗性、文創類或當代藝術型態之展覽。  蓬萊倉庫群－復刻百年鐵道的歷史紋理 共有7棟倉庫，自2012年加入駁二營運陣容，以舉辦展演活動和特色餐飲為主，並結合了周邊的哈瑪星鐵道文化園區，大人小孩都喜愛的哈瑪星台灣鐵道館就位在此區。  大義倉庫群－自成一格的職人藝術街區 共有6棟倉庫，為最後納入駁二版圖的區域，主要讓個人營業型態的工作室進駐，作為文化創意產業發展基地，各式各樣的特色小店、公共藝術作品藏在巷弄角落，以及假日的文創市集，是整個藝術園區最有文青味的地方。",
        "images": [
            "https://khh.travel/image/37665/?r=1642750902998",
            "https://khh.travel/image/20008/?r=1642750913108",
            "https://khh.travel/image/20001/?r=1642750934508",
            "https://khh.travel/image/37668/?r=1642751029879",
            "https://khh.travel/image/34297/?r=1642750999248",
            "https://khh.travel/image/37670/?r=1642750981785",
            "https://khh.travel/image/37666/?r=1642750962895",
            "https://khh.travel/image/37669/?r=1642750950558",
            "https://khh.travel/image/37667/?r=1642750971406"
        ]
    },
    {
        "id": 9,
        "name": "澄清湖風景區",
        "latlng": "22.66039,120.35377",
        "opentimeGoogle": [],
        "googleScore": null,
        "url": "https://khh.travel/zh-tw/Attractions/Detail/9",
        "cover": "https://khh.travel/content/images/Attractions/18665/480x360_attractions-image-7pecwyzwve2qfacpyjenoq.jpg",
        "type": "Attractions",
        "description": "位在鳥松區的澄清湖占地遼闊，原為曹公圳的灌溉埤塘，是高雄市的第一大湖，以三橋、六勝、八景為著名景點，園區設有7公里的環湖步道、青年活動中心，提供旅人體驗野營、從事各種戶外運動遊戲的絕佳場所。走在沿著湖面圍繞的環湖路線，沿途欣賞點綴其間的亭台樓閣，而自然生態豐富的園區，總吸引過境的水鳥，讓人能夠賞鳥、享受風景宜人、恬靜淡泊的休閒度假好去處。  三橋名勝之一：九曲橋 全長230公尺的九曲橋，以曲折有緻的九彎橋身為澄清湖畫上美麗豐富的層次。當旅人漫步橋上欣賞湖光山色時，潔白玲瓏的橋身倒映於碧綠湖水上，成為澄清湖最迷人的風景，尤其月明時刻，皎潔月影倒映粼粼湖水，因而贏得八景之一「曲橋釣月」的美名。  在中興塔上俯瞰都市景觀 順著步道而行，不時可見醒目的中式高塔，中興塔是澄清湖中最高的建築，潔白的塔身、紅色的拱頂，7層樓高的八角型中式寶塔，屹立於澄清湖的樹海之中亮麗而醒目。  塔內有雙層迴旋式石梯169級，登高望遠不僅將湖區美景盡收眼底，還能眺望市區的高樓大廈都市景色，隱約可見高雄港船隻的海港風光。  迷宮花園 榮獲2022建築景觀類園冶獎肯定，成全台最大的生態迷宮花園，從上空鳥瞰為一對鴛鴦心心相印的造型，內部設置各種親子闖關設施，是近期最夯的親子旅遊首選。  電影《魔戒》為發想的哈比屋，夢幻童話場景不用出國即可體驗；還有以下水道巨型涵管組成的五彩繽紛涵管迷宮，達120公分高，孩子彷彿變身電玩裡的超級瑪利歐，可在涵管中自由探索。在涵管的周遭，則是以廣闊綠地的空間設計，讓休憩用餐之際又可接近大自然，孩子在磨石子溜滑梯及草皮上盡情玩樂。 *入園人數採「定額總量管制」，每日以7,000人為原則，高雄市民免費入園限額5,000人，以園區入口處之看板做為管制人數之依據。*每日關園後實施清園，非園方或工作人員，不得於非開放時間在園區內逗留。*本園區為水源水質保護區，為維護環境生態及水質安全，入園遊客請遵守禁止攜帶貓狗等動物進入、傾倒廢棄物、隨地便溺、丟置垃圾或其他污染水源及破壞環境之行為。*本園區為空氣品質淨區，民國88年6月30日以前出廠之柴油大客車及民國92年12月31日以前出廠之二行程機車（取得排放檢驗合格者除外），請勿進入園區。*本園區禁止辦理選舉造勢活動及政治性集會。*各機關、團體、企業或個人使用本園區場地辦理活動，須事先取得園區管理單位同意，並於活動前繳付場地使用費及活動清潔維護費後始得辦理。*烤肉區清潔維護費每爐新台幣150元，請於活動當天至大門售票處購票。大型車：NT$60小型車：平日NT$60、假日NT$100機車：NT$30",
        "images": [
            "https://khh.travel/image/18662/?r=1586746744487",
            "https://khh.travel/image/18664/?r=1586746851955",
            "https://khh.travel/image/18659/?r=1586746764682",
            "https://khh.travel/image/18661/?r=1586746779453",
            "https://khh.travel/image/39342/?r=1651801936989",
            "https://khh.travel/image/39343/?r=1651802218984",
            "https://khh.travel/image/39345/?r=1651801947488"
        ]
    },
    {
        "id": 2,
        "name": "崗山之眼",
        "latlng": "22.81197,120.33435",
        "opentimeGoogle": [],
        "googleScore": null,
        "url": "https://khh.travel/zh-tw/Attractions/Detail/2",
        "cover": "https://khh.travel/content/images/Attractions/18315/480x360_attractions-image-sbna7gmxzku-rx5et7brjw.jpg",
        "type": "Attractions",
        "description": "登高望遠，蒼翠小崗山 崗山之眼園區位於岡山區與燕巢區交界的小崗山，佔地約1.8公頃，清代詩人卓夢采以「岡山樹色」這首詩來形容本地縱翠疊碧、綠意如煙，駐立崗山之眼視野所及一片遼闊，品味詩意，千古幽情風采重現。  天空廊道，漫步在雲端 崗山之眼園區以天空廊道為主角，全長88公尺，以音樂為設計概念，採用鋼構斜張橋之形式設計，主塔橋為提琴意象呈現，鋼索即為琴弦，意表琴瑟和鳴之意，於末端的迴旋梯則是應和的口琴，階梯踏面琴鍵亦隨之響起，走在天空廊道上微風吹過，彷若演奏著自然的樂曲，享受雲端漫步的視覺與聽覺饗宴，也象徵小崗山重生的生命樂章。  休憩觀光，鳥瞰大高雄 本園區之規劃以尊重環境和生態保育為主。天空廊道可俯瞰阿公店水庫、阿公店森林公園、阿公店溪及其平原之美景，天候良好時更能遠眺壯麗之北大武山與周邊群山，高雄市地標85大樓、半屏山、壽山、臺灣海峽更可一覽無遺，山水景色盡收眼底。   推薦遊程 賞景品茶香 崗山之眼→小崗山觀景台→大崗山風景區→午餐→泡茶品茗→廟宇巡禮晚餐(岡山老街/羊肉料理)  悠遊博物館 捷運紅線崗山南站→岡山文化中心/皮影戲博物館→台灣螺絲博物館→午餐(岡山老街/羊肉料理)→台灣滷味博物館→志斌豆瓣醬故事館崗山之眼→晚餐(大崗山風景區土雞料理)  軍事新體驗 航空教育展示館→軍史館→午餐(岡山老街/羊肉料理)→志斌豆瓣醬故事館→崗山之眼→晚餐(大崗山風景區土雞料理)  入園須搭乘接駁車或共乘計程車 ​崗山之眼園區自 08 時30分至 17 時(假日及連續假日至18時)管制遊客機車及小客車進入，騎車或開車民眾需到周邊停車場先行停車，再轉搭接駁車或共乘計程車進入。 因山區路寬較窄小坡度較高，夜間民眾開車上下山請減速行駛、注意行車安全並遵守交通規則。  交通資訊 ◾無障礙交通 1.自行開車： 身障人士可出示相關證件通行崗山之眼交通管制哨(水庫路與大莊路2巷路口)，以私車方式開入園區，園區停車場設有無障礙停車格3格停放。 2.大眾運輸： 復康巴士：請洽專線 (07)740-7977 或高雄客運復康巴士網站。 無障礙計程車：共乘叫車專線、0987-752787、0958-499030。 ※接駁公車皆屬一般中型巴士，因通往崗山之眼路寬及周遭樹木環境物關係，中型低底盤公車無法行駛。  ◾捷運(須轉共乘計程車) 1.搭乘高雄捷運紅線到捷運南岡山站(R24站)，從1號出口搭「紅68」至大莊公園轉搭共乘計程車前往崗山之眼園區。 (紅68公車時刻表請參考高雄客運網站 ) 2.共乘計程車：  (1)崗山之眼園區共乘計畫由本府交通局核定。 (2)於高雄捷運紅線南岡山站 (R24)、阿公店水庫管理中心、阿公店森林公園及大莊公園皆規劃有排班計程車區，提供民眾共乘。 (3)崗山之眼園區共乘計程車預約專線：0987-752787、0958-499030 (4)共乘費率依本府交通局核定之共乘費率收費如下   ◾ ​​自行開車(須轉乘接駁車或共乘計程車) 1.國道路線 (1)國道1號→在岡山交流道出口下交流道→燕巢→安招路/186市道→左轉新生路→右轉菜寮路→阿公店水庫管理中心周邊停車場及接駁區。  (2)國道10號→燕巢交流道→義大路→右轉角宿路/186市道→直行接中興北路/高29-1區道→左轉工程路接菜寮路，約400公尺即到逹阿公店水庫管理中心周邊停車場及接駁區。  2. 停車資訊 (1)阿公店水庫管理中心：大客車停車格4格、小客車停車格113格(含無障礙停車格 3格)、機車停車格 36 格。 (2)阿公店森林公園：小客車 79 格、機車停車格 30 格。 (3)菜寮路停車場：小客車 13 格。 (4)水庫路停車場：小客車34格。(設有接駁站) ※ 崗山之眼園區：無障礙停車格 3 格 (身障人士得出示相關證明文件通行交通管制哨)。 ※ 因停車空間有限，建議民眾搭乘大眾運輸前往。  ◾ 接駁資訊 (1)113年3月26日起試辦由水庫路停車場至崗山之眼園區循環接駁。 (2)中巴接駁車服務專線：高雄客運 07-6118804 (3)接駁站、收費方式及發車時間接駁站平日假日單價(單趟)首班車末班車首班車末班車水庫路停車場08:3016:2008:3017:20全票25元 半票13元 (7-12歲兒童及65歲以上長者) 六歲以下兒童免費崗山之眼園區08:5017:3008:5018:30※接駁車約20-30分鐘一班，人潮眾多時可能延誤，敬請耐心等候。 ※15人以上團體請先填寫網路表單，或洽高雄客運專線 07-6118804 (蔡小姐)。 註：登錄作業需於搭車前 7日完成網路登錄；若欲取消則須於搭車前 3日，以電話聯繫本公司承辦人完成取消作業。   ◾開放時間平日09:00–17:00（週一公休，連續假日除外），最後入場時間為16:45假日09:00–18:00，最後入場時間為17:45◾注意事項1.非開放通行期間以安全為考量，禁止進入天空廊道，擅自進入者後果自行負責。2.參觀遊客如有明顯意識不清或酒醉行為者嚴禁進入，另懼高症、高血壓、心臟病、氣喘、孕婦或其他身體狀況不宜通行者，為維護安全請勿進入。3.天空廊道參觀動線原則上由主入口廣場區之無障礙斜坡棧道進入廊道，沿道遊覽至末端迴旋梯離開；嬰幼兒車及輪椅從斜坡棧道進入廊道後參觀完畢再折返。4.為維護參觀品質及旅遊安全，遊客參觀時請勿吸煙，亦禁止攜帶寵物、爆裂物或其他可能造成設施損壞之物品。 5.天空廊道上勿撐傘、穿著高跟鞋、跑跳、喧鬧、攀爬、丟擲物品等行為。遊客請依序進入並循規定路線參觀，如有緊急狀況，遊客應遵從服務人員指示儘速離開。6.遇有颱風、地震、豪雨、強風、落雷及其他不適天空廊道通行之天候時，本局得停止開放通行，俟設施安全無虞後再行公佈開放日期。7.遙控無人機操作人應遵守「民用航空法」、「遙控無人機管理規則」及相關規定。",
        "images": [
            "https://khh.travel/image/18322/?r=1591088705541",
            "https://khh.travel/image/20191/?r=1591088776911",
            "https://khh.travel/image/18314/?r=1591088791002",
            "https://khh.travel/image/35279/?r=1688696019956",
            "https://khh.travel/image/51018/?r=1710909243543"
        ]
    },
    {
        "id": 141,
        "name": "潮旅梓官（蚵仔寮漁港）",
        "latlng": "22.72687,120.25446",
        "opentimeGoogle": [],
        "googleScore": null,
        "url": "https://khh.travel/zh-tw/Attractions/Detail/141",
        "cover": "https://khh.travel/content/images/Attractions/20397/480x360_attractions-image-kdxpvjqzwewisunxyad_9w.jpg",
        "type": "Attractions",
        "description": "位於梓官區信蚵村的蚵仔寮昔日是養蚵捕魚為生的小漁村，近年來在地方青年及政府的努力下，成功地將傳統漁村轉形為觀光漁港及漁市場，由於拍賣制度健全，吸引了鄰近地區漁船到此卸貨交易，使得港口魚貨日益新鮮眾多，為全國現撈漁獲之冠、同時也是烏魚子的重要產地。  蚵仔寮魚市引進先進的HACCP食品安全管制系統，使現撈漁獲保持新鮮與安全，每天下午漁船返港時，就是市場人聲鼎沸、魚鮮爭豔的時刻。民眾可以在蚵仔寮漁港參觀魚市拍賣過程、盡情挑選魚鮮海味，香噴噴的各式海鮮攤位滿足了每位饕客的味蕾。  熱鬧過後的蚵仔寮漁村，撩起許多人對小漁村的好奇心，這小漁村還藏著哪些秘密景點，想讓人一探究竟，不知不覺找到了巷弄中的劉文禧故居，是赤崁保存最完整的百年古厝，接著走到了稻田旁的裝置藝術，是全村居民合力將當地螺絲工廠淘汰的廢品變成翩翩飛舞的蝴蝶和蜻蜓，讓整個漁村小鎮365天都是春天。漫步在神秘小漁村後的時光，適合小酌一杯，在港口邊的小酒館，享用漁港新鮮燒烤，深深體驗滿滿的港都風情，讓人印象深刻的高雄海線。 漁市還有參觀冷凍工廠、魚簍及海鮮飯團DIY及藍色公路(觀光船)等等深度旅行，行有餘力時也可繞到梓官的赤崁聚落，欣賞三合院紅磚古厝及傳統漁村風光。蚵仔寮漁港由於多元化的觀光環境、美麗的蔚藍海景和浪漫的落日景觀，在2012年榮獲十大魅力漁港魅力組第一名，陽光、熱情與活力，是令人戀戀不忘的漁港風情。 圖片來源（高雄畫刊－潮旅梓官 來杯海味特調看夕陽）",
        "images": [
            "https://khh.travel/image/20397/?r=1673947703259",
            "https://khh.travel/image/43014/?r=1673947714568",
            "https://khh.travel/image/43011/?r=1673947716936",
            "https://khh.travel/image/39190/?r=1650507341638",
            "https://khh.travel/image/39186/?r=1650506273752",
            "https://khh.travel/image/39189/?r=1650505555375"
        ]
    },
    {
        "id": 165,
        "name": "西子灣風景區",
        "latlng": "22.62488,120.26476",
        "opentimeGoogle": [],
        "googleScore": null,
        "url": "https://khh.travel/zh-tw/Attractions/Detail/165",
        "cover": "https://khh.travel/content/images/Attractions/20096/480x360_attractions-image-uvtvvevo5egnvisijj_b8a.jpg",
        "type": "Attractions",
        "description": "西子灣以夕陽美景及天然礁石聞名，區內包括了西子灣海水浴場、海濱公園、打狗英國領事館....等景點；可觀海景、遠眺高雄港；海水浴場極富熱帶氣息、南國風情，每當夜幕低垂，晚霞的照耀，漁船燈火閃爍其間，呈現海天一色美景。西子灣的西子夕照為高雄八大勝景之一，每到日落時分，沿著海岸護堤的石砌欄杆，成為欣賞落日餘暉的最佳位置。 在西子灣不遠處，哨船砲臺之門額題字為「雄鎮北門」，字體碩大，筆力雄渾。此為清光緒元年所建立，目前為直轄市定古蹟。其與旗后砲臺同時期建成，互為犄角，如今大砲今已不存，只剩弧型砲座可供後人發思古之幽情。  西子灣遊客中心(哨船頭公園) 哨船頭公園位於鼓山區哨船街與安船街交叉口，對岸是鼓山渡輪站，所在的哈瑪星地區依山傍水，有得天獨厚的自然資源與歷史人文古蹟，規劃時即著重以哈瑪星地區整體發展為主軸。公園總面積0.63公頃，在此可欣賞鼓山、旗津間渡輪往返、高雄港風光、八十五層大樓等盛景。 位於鼓山哨船頭公園內的「西子灣遊客中心」，有著獨特的外觀造型，不論是從陸地上甚至是從海上觀賞，皆相當引人注目，尤其搭配整個高雄港、展覽館及高雄地標85大樓，儼然成為高雄港的重要地標之一。 除了亮眼外觀，西子灣旅客中心還兼具旅客諮詢服務、文創商品、在地文化展演等多項服務，讓外地遊客來此地歇腳、諮詢外，可以慢慢品味在地的風俗民情及文化之美。 打狗英國領事館文化園區 「西子灣」是高雄著名的避暑勝地，在抵達西子灣入口處右方的山坡，有一個白色「之」字型的階梯，在一片綠意中顯得特別鮮明，拾級而上，一步山、一步海，彷彿是一趟朝聖之旅。打狗英國領事館是建於1879年的英式建築，領事館位於哨船頭碼頭邊，領事官邸則建於小山丘上，背山面海，是臺灣現存年代最久的西式近代建築，更是英國政府在臺灣的第一座領事館。  園區內完整保存官邸及領事館以及一條相互連通的登山古道。手輕撫過打狗英國領事館官邸得每一塊紅磚，都能感受歲月的痕跡，歷史在你的手中，而高雄美景就在腳下，在這個山海交接處，好風景一網打盡。建議造訪打狗英國領事館官邸的最佳時間是下午到傍晚時分。往東望，整個高雄港區的壯麗景觀一覽無遺，高雄85大樓、夢時代摩天輪，形成一幅熱鬧繽紛的現代畫作；向南看，與旗津漁港遙望，漁船、渡輪往返，偶爾傳來汽笛聲，顯得平靜而悠閒。往西望，則是臺灣八景之一的「西子夕照」，時而平靜無波、時而波瀾壯闊。園區內更結合了休閒餐飲，讓民眾可以在此用餐、品茶，讓古老建築展現新的浪漫情調。 哨船頭遊艇碼頭 哨船頭遊艇碼頭位於鼓山區哨船街與安船街路口，旁有哨船頭景觀公園，穿過人行景觀橋可與對岸熱鬧的鼓山渡輪頭相通，卻多了一份悠閒與寧靜的氣氛。哨船是巡邏船之意，哨船頭舊名哨船町，是高雄哈瑪星早期發跡的海港，如今漁業轉型觀光，哨船頭成為專門停泊遊艇的碼頭，而景觀公園也廣植各種濱海植物及親水設施供遊客自在漫遊，佇立碼頭區享受徐徐海風吹拂，除了欣賞造型新穎的各式遊艇及對岸渡船進出，更是眺望旗后山、燈塔及港都雄偉景觀的最佳地點，無論是白日的藍天碧海或金黃燦爛的夕照，都有無限的悠閒與浪漫氣息。 哨船頭山碉堡 由安船街30巷小公園對面的登山小徑進入，循打狗英國領事館官邸景觀步道前進，步行不到1分鐘即可抵達。 十八王公廟 雄踞於高雄港入口處的山岬上，視野寬闊美麗，廟宇建築保有傳統閩式風格，廟前為一陡峭險峻的階梯‧傳聞意在考驗信徒「無誠勿登」。 根據廟內石碑記載，清康熙年間有18位中國商人跨海渡台由現今西子灣上岸墾荒，卻被視為叛民集體革殺，附近居民感念18位先民的精神，就收歛遺體集中收納祠堂供祭，此為王公廟最早起源。 日治時代，日人為了開闢高雄港，開鑿現今的西子灣山洞，不料工程不順、死傷無數，經居民建議，日本官府焚香向18王公祈求庇佑之後才得以順利完成，經地方人士四處集資，在現今中山大學運動場的用地上，興建最早的十八王公廟，後來配合中山大學建校，該廟才在1984年間遷至山岬上的現址，由於夜晚到西子灣看海人潮日增，該廟香火也隨之鼎盛。 雄鎮北門 初建於鄭氏時期，清領時期聘法國技師建造西式砲台，城牆為三合土及紅磚砌成，與旗津的威震天南砲台，相互鎮守高雄港，扼控海疆險要。也是清領時期從旗后往鳳山舊城的交通要衝，日前修建為古蹟公園，是遠眺西子灣與近看船隻往來港口的最佳景點 。夏季才開放玩水",
        "images": [
            "https://khh.travel/image/20454/?r=1590456457728",
            "https://khh.travel/image/20471/?r=1590456949294",
            "https://khh.travel/image/20473/?r=1590457590372",
            "https://khh.travel/image/20476/?r=1590457644798",
            "https://khh.travel/image/20480/?r=1590457844791",
            "https://khh.travel/image/20483/?r=1590457966414"
        ]
    }
]